/* --------------------------------- 元组定义 --------------------------------- */
// 值必须与定义的类型一一对应
;(function () {
  let tuple: [string, number] = ['12', 123]
  tuple.push(1) // 可以放入元组已经定义的类型 但是不能通过索引拿到多余的元素
  // tuple[3] = 123 // 不能通过索引添加元素
})()

/* --------------------------------- 可变元组 --------------------------------- */
;(function () {
  // 可变元组
  let tiple1: [number, string, ...any[]] = [1, '2', 3, 4]
  // 元组标签 仅仅可读性好
  let tiple2: [age: number, name: string, ...args: any[]] = [1, '2', 3, 4]
  console.log(tiple2[0])
})()
